In [6]:
import pandas as pd

In [7]:
from math import sqrt

In [8]:
import matplotlib.pyplot as plt

Matplotlib is building the font cache; this may take a moment.

In [9]:
from sklearn.model_selection import train_test_split

In [10]:
from sklearn.linear_model import LinearRegression

In [11]:
from sklearn.metrics import mean_squared_error, r2_score

In [12]:
from sklearn import preprocessing

In [17]:
data = pd.read_csv('ozone.csv', sep=';')

In [18]:
data.head()

,obs,maxO3,T9,T12,T15,Ne9,Ne12,Ne15,Vx9,Vx12,Vx15,maxO3v,vent,pluie
0,601,87,"15,6","18,5","18,4",4,4,8,"0,6946","-1,7101","-0,6946",84,Nord,Sec
1,602,82,17,"18,4","17,7",5,5,7,"-4,3301",-4,-3,87,Nord,Sec
2,603,92,"15,3","17,6","19,5",2,5,4,"2,9544","1,8794","0,5209",82,Est,Sec
3,604,114,"16,2","19,7","22,5",1,1,0,"0,9848","0,3473","-0,1736",92,Nord,Sec
4,605,94,"17,4","20,5","20,4",8,8,7,"-0,5","-2,9544","-4,3301",114,Ouest,Sec

In [19]:
y = data["maxO3"]

In [20]:
y

0       87
1       82
2       92
3      114
4       94
      ...
107     84
108     77
109     99
110     83
111     70
Name: maxO3, Length: 112, dtype: int64

In [24]:
data = data[
    ['T9', 'T12', 'T15', 'Ne9', 'Ne12', 'Vx9', 'Vx12', 'Vx15', 'maxO3v']
]

In [25]:
data

       T9   T12   T15  Ne9  Ne12      Vx9     Vx12     Vx15  maxO3v
0    15,6  18,5  18,4    4     4   0,6946  -1,7101  -0,6946      84
1      17  18,4  17,7    5     5  -4,3301       -4       -3      87
2    15,3  17,6  19,5    2     5   2,9544   1,8794   0,5209      82
3    16,2  19,7  22,5    1     1   0,9848   0,3473  -0,1736      92
4    17,4  20,5  20,4    8     8     -0,5  -2,9544  -4,3301     114
..    ...   ...   ...  ...   ...      ...      ...      ...     ...
107  13,3  17,7  17,8    3     5        0       -1  -1,2856      76
108  16,2  20,8  22,1    6     5  -0,6946       -2  -1,3681      71
109  16,9    23  22,6    6     4      1,5   0,8682   0,8682      77
110  16,9  19,8  22,1    6     5       -4  -3,7588       -4      99
111  15,7  18,6  20,7    7     7        0  -1,0419       -4      83

[112 rows x 9 columns]

In [26]:
data.describe()

              Ne9        Ne12      maxO3v
count  112.000000  112.000000  112.000000
mean     4.928571    5.017857   90.571429
std      2.594916    2.281860   28.276853
min      0.000000    0.000000   42.000000
25%      3.000000    4.000000   71.000000
50%      6.000000    5.000000   82.500000
75%      7.000000    7.000000  106.000000
max      8.000000    8.000000  166.000000

In [27]:
data.head()

     T9   T12   T15  Ne9  Ne12      Vx9     Vx12     Vx15  maxO3v
0  15,6  18,5  18,4    4     4   0,6946  -1,7101  -0,6946      84
1    17  18,4  17,7    5     5  -4,3301       -4       -3      87
2  15,3  17,6  19,5    2     5   2,9544   1,8794   0,5209      82
3  16,2  19,7  22,5    1     1   0,9848   0,3473  -0,1736      92
4  17,4  20,5  20,4    8     8     -0,5  -2,9544  -4,3301     114

In [29]:
data.describe()

              Ne9        Ne12      maxO3v
count  112.000000  112.000000  112.000000
mean     4.928571    5.017857   90.571429
std      2.594916    2.281860   28.276853
min      0.000000    0.000000   42.000000
25%      3.000000    4.000000   71.000000
50%      6.000000    5.000000   82.500000
75%      7.000000    7.000000  106.000000
max      8.000000    8.000000  166.000000

In [30]:
data

       T9   T12   T15  Ne9  Ne12      Vx9     Vx12     Vx15  maxO3v
0    15,6  18,5  18,4    4     4   0,6946  -1,7101  -0,6946      84
1      17  18,4  17,7    5     5  -4,3301       -4       -3      87
2    15,3  17,6  19,5    2     5   2,9544   1,8794   0,5209      82
3    16,2  19,7  22,5    1     1   0,9848   0,3473  -0,1736      92
4    17,4  20,5  20,4    8     8     -0,5  -2,9544  -4,3301     114
..    ...   ...   ...  ...   ...      ...      ...      ...     ...
107  13,3  17,7  17,8    3     5        0       -1  -1,2856      76
108  16,2  20,8  22,1    6     5  -0,6946       -2  -1,3681      71
109  16,9    23  22,6    6     4      1,5   0,8682   0,8682      77
110  16,9  19,8  22,1    6     5       -4  -3,7588       -4      99
111  15,7  18,6  20,7    7     7        0  -1,0419       -4      83

[112 rows x 9 columns]

In [32]:
data.describe(include='all')

          T9   T12   T15         Ne9        Ne12  Vx9 Vx12 Vx15      maxO3v
count    112   112   112  112.000000  112.000000  112  112  112  112.000000
unique    70    78    81         NaN         NaN   65   67   66         NaN
top     16,9  18,2  20,3         NaN         NaN    0    0    0         NaN
freq       6     4     4         NaN         NaN   13    5    7         NaN
mean     NaN   NaN   NaN    4.928571    5.017857  NaN  NaN  NaN   90.571429
std      NaN   NaN   NaN    2.594916    2.281860  NaN  NaN  NaN   28.276853
min      NaN   NaN   NaN    0.000000    0.000000  NaN  NaN  NaN   42.000000
25%      NaN   NaN   NaN    3.000000    4.000000  NaN  NaN  NaN   71.000000
50%      NaN   NaN   NaN    6.000000    5.000000  NaN  NaN  NaN   82.500000
75%      NaN   NaN   NaN    7.000000    7.000000  NaN  NaN  NaN  106.000000
max      NaN   NaN   NaN    8.000000    8.000000  NaN  NaN  NaN  166.000000

In [37]:
def normalization(dataToNormalize):
    columns = dataToNormalize.columns
    for column in columns:
        x = dataToNormalize[column].values.astype(float)
        standard_normalization = preprocessing.StandardScaler()
        res = standard_normalization.fit_transform(x)
        dataToNormalize[column] = res

In [38]:
normalization(data)

ValueError: could not convert string to float: '15,6'